//复合数据类型简介
/*



C++提供了基础的数据类型
但有些时候这些数据类型不够用：

例如如何在程序中表示分数：？
或许可以使用一对整数（一个用于分子，一个用于分母）：
int main()
{
    // 第一个分数
    int num1 {};
    int den1 {};

    // 第二个分数
    int num2 {};
    int den2 {};

    // 用这个char来读取分子与分母之间的 '/'
    char ignore {};

    std::cout << "Enter a fraction: ";
    std::cin >> num1 >> ignore >> den1;

    std::cout << "Enter a fraction: ";
    std::cin >> num2 >> ignore >> den2;

    std::cout << "The two fractions multiplied: "
        << num1 * num2 << '/' << den1 * den2 << '\n';

}
其中char ignore用来存储/
这个程序虽然起效，用整数来表示分子分母,能够完成两个分数相乘

但是每对整数都只是松散的连接在一起，除了细看能知道他们是分子分母，
但是也只是单纯的表示；

其次我们应该用函数来实现分数的输入，但是函数只能返回一个值，
那怎么返回呢？

现在想象另一个情况，我们要存储员工的id；

    int id1 { 42 };
    int id2 { 57 };
    int id3 { 162 };
但是假如有很多很多员工？我们要是需要将他们打印或者传递，那么就需要很多重复的代码。


显然基本类型能解决的有限。







复合数据类型：
幸运的是C++,可以从基本数据类型构造复合数据类型；
每个复合类型也有自己的唯一属性。


C++支持以下复合类型：
1.函数
2.数组
3.指针类型：
   1）对象指针
   2）函数指针
4.指向成员类型的指针：
   1）指向成员函数的指针
   2）指向成员数据的指针
5.引用类型：
   1) 左值引用
   2) 右值引用
6.枚举类型
   1强作用域枚举
   2弱作用域枚举
7.类类型
   1stuct
   2class
   3union



我们用的函数就是一中复合类型:
void doSomething(int x, double y)
{

}
此函数的类型为void(int,double);
此类型就是由三个基本类型组成，函数有自己的特殊行为(如可调用)。



这里介绍：
左值引用
指针
下一章介绍：
枚举类型以及struct；
后面
还会有class，数组类型
比如之前的std::string 实际上是class；




*/