//值类别
/*
左值lvalue
右值rvalue



左值是什么：
表达式：可以执行以产生特定值的量和运算符的组合。
列如:
std::cout << 2 + 3 << '\n'; 
// 表达式 2 + 3 就是表达式，产出值 5
有些表达式可以产生一些副作用，
int x { 5 };
++x; 
// 这个表达式的副作用是将 x 加1 ，并且表达式结束后，x的更改也依旧保持；




表达式的属性：
为了确定表达式的计算方式和使用位置
表达式有俩属性：类型和值类别


表达式的类型：
等效于由表达式计算出的值，对象或类型；
auto v1 { 12 / 4 };   
auto v2 { 12.0 / 4 }; 
第一句中，表达式12/4产出3 ，并且为int 则int就是表达式的类型
第二句，表达式产生3.0 则表达式为double类型

编译器可以根据表达式的类型来确定表达式
在程序中是否有效；
void print(int x)
{
    std::cout << x << '\n';
}
int main()
{
    print("foo"); 
    return 0;
}
这里上下文 也就是print调用 要求传入int类型参数
而表达式foo是string类型的字面值 因此表达式就是string类型
这是无效的
请注意，表达式的类型在编译时可确定(否则类型检查和类型推导不起作用)
然后，表达式的值既可以在编译时确定 也就是常量表达式
也可以在运行时确定 也就是非常量表达式




表达式的值类别：
int main()
{
    int x{};

    x = 5; 
    5 = x; 

    return 0;
}
第一句可以 将5赋值给x
第二句不可以 因为将x的值赋给字面值5很迷惑

那么编译器如何知道 赋值语句左右可以有什么表达式呢？
答案在于表达式还有一个属性叫做：值类别
也就是分为左值和右值
也就是能放在左边的和能放在右边的
上方第二句就是将左右值搞反了





左值和右值表达式：

lvalue是计算为可识别对象或函数（或位字段）的表达式。
C++使用术语“实体”，没有什么明确定义。
具有标识的实体 可以与其他实体区分开来，通过比较实体的地址；
就是不同的变量 或者函数；
具有标识的实体可以通过标识符，引用或者指针访问，并且其生存周期通常比语句和表达式长。
int main()
{
    int x { 5 };
    int y { x }; // x 是左值表达式

    return 0;
}
其中的x为左值表达式，x就是他的产出值，计算为了x这个可识别的对象
自从在语言中引入常量以来，左值分为两个子类型：可修改左值是其值可以修改的左值。不可修改左值是其值不能修改的左值（const或constexpr）。
也就是变量和常量。


rvalue是不是左值的表达式。
右值表达式通常计算为一个值，
常见的右值包括字面值，以及函数和运算符的返回值
右值不可识别，他们就是一个值。
int main()
{
    int x{ 5 }; // 5 是右值表达式
    const double d{ 1.2 }; // 1.2 是右值表达式

    int y { x }; // x 是可修改的左值表达式
    const double e { d }; // d 是不可修改的左值表达式
    int z { return5() }; // return5() 是右值表达式 (因为它的结果是按值返回)

    int w { x + 1 }; // x + 1 是右值表达式
    int q { static_cast<int>(d) }; // static_cast的结果是右值表达式

    return 0;
}
其中函数的返回值也是右值表达式，也就是是一个值，而不是可识别的对象；
因此5 = x；不能使用的原因是因为
赋值语句左操作数要求是可更改的左值；
右操作数是右值表达式；
而5 = x；反了







左值到右值的转换：
int x { 5 };
int y { x };
在期望右值的位置
如果我们提供了左值，将隐式转换为右值表达式。
左值表达式x进行左值到右值的转换，其计算为值5，然后用于初始化y。


int x{ 1 };
int y{ 2 };

x = y; // y 是一个可修改的左值表达式, 而不是右值，但这是合法的
y经历了左值到右值转换，然后赋值给x；
x = x + 1;
左侧还是x左值表达式，也就是对象。
右侧先转换然后+1 为3 也就是计算值3 右值。





*/