//左值引用
/*

引用是现有对象的别名.
也就是同一块内存。




左值引用类型：
通常称为引用,用新名称来充当现有左值的别名；

左值引用变量：
int b { 5 };
int& a {b};
a是b的新别名；

a和b可以同义使用。

从编译器角度看
int& ref或者int &ref
并不重要
现在更倾向于前者。



通过左值引用修改值：
使用引用来修改被引用对象的值：
int x { 5 }; 
int& ref { x }; 
此时x与ref是一个量
可以使用x=6；或者ref =6 ；来一起修改这一个值
不管是x和ref都是6；





左值引用的初始化：
int& invalidRef;   // error: 引用必须被初始化
引用必须初始化，必须说明引用的是哪个。
并且引用的
1.不能是const 只读变量
2.不能是右值
也就是可修改的左值；
也就是不能是不可修改的值；
也就是左值引用被称为非常量引用；


在大多数情况下，引用的类型必须与被引用的类型匹配：
被引用的左值必须和别名一个类型；
并且void不允许引用；



引用无法重置（不能再更改为引用其他对象）：
一旦初始化，C++中的引用就不能重置，这意味着不能将其更改为引用另一个对象。
int x { 5 };
int y { 6 };


int& ref { x }; // ref 是 x 的别名
ref = y; 
这一行其实是将y的值赋给了以ref为别名的y；
而不是把ref改成了y 的别名；









左值引用的作用域：
与普通变量的作用域规则相同；
#include <iostream>

int main()
{
    int x { 5 }; // 普通变量
    int& ref { x }; // 变量x的引用

     return 0;
} // x 和 ref 在这里失效



引用和被引用对象具有独立的生命周期：
谁先销毁都可以；
int main()
{
    int x { 5 };

    {
        int& ref { x };   // ref 是 x 的引用
        std::cout << ref << '\n'; // 打印 ref 的值 (5)
    } // ref 在这里被销毁 -- x 不受影响

    std::cout << x << '\n'; // 打印 x 的值 (5)

    return 0;
} // x 在这里被销毁
上述ref在内部块就被销毁了，但是x不受影响

但是如果反过来，
那么引用会变成悬空引用；
访问悬空引用会导致未定义的行为。

这很容易避免：按引用返回和按地址返回。


引用不是对象：
引用不是新创了一个内存存放数据，
引用不需要存在或占用存储。
如果可能 就像宏一样
编译器会使用被引用的对象去替换所有引用。
这样可能会需要存储空间；

因为引用不是对象，所以不能在需要对象的时候使用
例如：不能引用引用
但是在需要引用表现得像对象一样
可以被引用的时候后需要std::reference_wrapper;




*/