//const的左值引用
/*
上一次，我们知道了 ：
被引用的必须是非常量值；
这意味着以下非法：
const int x { 5 }; // x 是不可修改的（const）左值
int& ref { x }; // error: ref 不能绑定到 不可修改的左值

但如果我们想为一个常量创建引用？


常量的左值引用:
我们在引用前也加上const就可以了
const int x { 5 };    // x 是不可修改的左值
const int& ref { x }; // okay: ref 可以引用到 x
但是依旧不可以通过引用更改常量：
std::cout << ref << '\n'; // okay: 我们可以访问 const 变量
ref = 6;                  // error: 不能通过常量引用修改对象
但是可以访问；





使用可修改的左值初始化对常量的左值引用：
就是可以是给非常量起const别名
这样通过引用访问时，属性是const
但是本质还是非常量
int x { 5 };          // x 是可修改的左值
const int& ref { x }; // okay: ref 可以引用到 x

std::cout << ref << '\n'; // okay: 可以通过常量引用访问 x
ref = 7;                  // error: 不能通过常量引用修改对象

x = 6;
这时，使用const就是常量属性
使用x就是变量属性





使用右值初始化对const的左值引用：
const 左值引用可以绑定到右值；
const int& ref { 5 }; // okay: 5 是一个右值
std::cout << ref << '\n'; // 打印 5
当这种情况发生时，将创建一个临时对象并用右值初始化，并且将常量引用绑定到该临时对象。





绑定到临时对象的常量引用延长了临时对象的生命周期：
临时对象(也就是语句里创建的通常会在表达式末尾被销毁)；
但是如果我们在语句内对他引用
这样这个临时对象会和引用一个生命周期





constexpr左值引用（可选阅读：
constexpr允许在其常量表达式中有引用；
在constexpr有一个特殊限制，
里面的引用只能绑定到具有静态存储器的变量
也就是全局或局部的静态变量；




*/
