//通过左值引用传递函数参数
/*

但是我们会疑惑，
为啥要有个别名，我直接写原对象不好了？

函数参数传递：
void printValue(int y)
{
    std::cout << y << '\n';
} // y 在这里被销毁
int main()
{
    int x { 2 };

    printValue(x); // x 按值拷贝到 y (如果x是比较大的对象，会非常消耗资源)

    return 0;
}
如果传入的参数是一个超级大的东西
那么传参实际上是复制初始化
这样很消耗资源
那么我们直接把原来的内存拿出来用不就好了？




引用传递参数：
那我们把函数参数类型设置为引用不就好了
这样我们在函数里使用的数据就是原本的了
void printValue(std::string& y) // 类型更改为 std::string&
{
    std::cout << y << '\n';
} // 变量y这里被销毁

int main()
{
    std::string x { "Hello, world!" };

    printValue(x); // x 现在按引用传递给参数 y (代价小)

    return 0;
}
其实就是把x这个左值传给引用了；
访问的是实际的x，而不是x的副本；


通过引用传递参数允许我们更改参数的值：
这样我们在函数里对于函数参数的更改也就可以直接作用了：







按引用传递参数只能接受可修改的左值:
但是只能是非const 类型的参数
并且绑定的也只能是非const

*/