//指针简介
/*

事实上，指针很像左值引用




char x {}; // char 使用1字节内存
执行该语句时，意思就是：
1.向编译器申请一块内存
2.假设编译器给了地址140的内存，我们往里存入了空
3.以后访问x时，其实是访问的地址140

变量的好处是：
不管3721
我知道这个变量的标识符
就可以直接通过标识符来让编译器自己去查地址，然后访问数据

引用也是如此
char x {}; // 假设x的内存地址是 140
char& ref { x }; // ref 是 x 的左值引用 (当与类型一起使用时， & 代表左值引用
其实是把ref指的也是140


取地址操作（&）
尽管默认情况下，变量所对应的地址不会告诉我们
但是我们确实可以访问
&操作符会返回操作数的地址
int x{ 5 };
std::cout << x << '\n';  // 打印变量 x 的值
std::cout << &x << '\n'; // 打印变量 x 的地址



解引用运算符（*）:
知道变量的地址其实并没有用；
我们可以对地址做的最有用的事情是访问存储在该地址的值。解引用运算符（*）将给定内存地址处的值作为左值返回：

std::cout << *(&x) << '\n';
其中&x是x的地址
我们再用*返回这个地址所存储的值
其实就相当于两次相反的操作



指针（pointer）:
那我们把这个地址存储到对象里 
这个包含了地址信息的对象就叫指针；


与&声明引用相同
指针用*声明
int;  // 普通的 int
int&; // int的左值引用
int*; // 指向int的指针 (保存对应的内存地址)

int x { 5 };
int* ptr; 
这里的*号是声明语法的一部分 与*解引用操作符不同




指针初始化：
指针也需要初始化
尚未初始化的叫野指针；
其内部的数据是垃圾地址
int x{ 5 };
int* ptr3{ &x };
将x的地址通过&返回
然后存入这个指针类型名叫ptr的变量里，


有了这个指针 我们就可以用*操作符来访问地址的值
这里
ptr就是值
*ptr就是把ptr存储的值 当作地址
其所对应的数据
这里是个标识符
也可以用右值

就像引用的类型必须匹配被引用对象的类型一样，指针的类型必须与所指向的对象的类型匹配：
不允许使用字面值初始化指针；
int* ptr{ 0x0012FF7C }; // not okay, 0x0012FF7C 被认为是int字面值






指针和赋值：
1.改变指针所指向的对象（为指针赋值一个新的所指向的地址）
2.改变指针指向对象的值（通过解引用操作，为所指对象赋值）

也就是把一个定义好的指针指向别处
改变原始值


int x{ 5 };
int* ptr{ &x }; // ptr 初始化指向 x
int y{ 6 };
ptr = &y; // 将ptr 指向 y
ptr本质上是个变量 赋值就好了


int x{ 5 };
int* ptr{ &x }; // ptr 初始化指向 x

解引用然后赋值
*ptr = ，，，此时操作的就是那块内存






指针的行为很像左值引用：

区别：
1，引用必须初始化
2. 引用不是单独的对象，本质上是俩标识符指向同一个地址
而 指针是把a的地址赋值给指针类型b 然后通过操作符*去根据b所存储的地址找到a

3.引用无法重新指定，而指针可以，把值改为别的变量的地址就好
4.引用必须始终绑定对象，虽然可能会悬空 
指针可以指向空
5.引用是安全的，指针本身很危险



取址操作返回的是指针：
取址操作符返回的是一个指针，而不是文本




指针的大小：
32位用的是32位地址，所以指针就是32位
其他均是如此


悬空指针：
与悬空引用相似
当被对象被销毁时，指向他的指针将不再有效
再去解指针将会导致不知道行为

int main()
{
    int x{ 5 };
    int* ptr{ &x };

    std::cout << *ptr << '\n'; // 有效

    {
        int y{ 6 };
        ptr = &y;

        std::cout << *ptr << '\n'; // 有效
    } // y 被销毁, ptr现在是悬空指针

    std::cout << *ptr << '\n'; // 解引用悬空指针，未定义的行为

    return 
}


*/