//空指针
/*
指针是保存另一个对象地址的对象。
可以使用解引用运算符（*）来访问该地址保存的对象：




空指针:
指针可以保存空值；
意味着没有指向任何一个地址
int* ptr {}; // ptr 是一个空指针，不指定任何对象

可以通过赋值来更改指针内容，因此最初设置为null的指针稍后可以更改为
指向有效对象



nullptr关键字：
就像true和flase一样
可以显示声明定义空指针
int* ptr { nullptr }; // 使用nullptr，显式声明ptr是空指针
对于已经创建好的也可以
ptr2 = nullptr; 
还可以把这个当作参数传递
someFunction(nullptr); 




解引用空指针会导致未定义的行为：
检查空指针：
我们可以用条件语句来测试一个指针是否为空
if (ptr == nullptr) // 显式检查
        std::cout << "ptr is null\n";
    else
        std::cout << "ptr is non-null\n";

类似于bool值隐式转换为0和1
指针也将隐式转换为布尔值：空指针转换为布尔值false，非空指针转换成布尔值true。
允许跳过显示测试
可以直接
if(指针)
如果为空 则为flase
如果为非空 则为true






使用nullptr避免悬空指针：
悬空和空不一样
空是指针没有存储地址
悬空是指针里地址还在，但是原变量消失了

并且当我们销毁变量时，指向他的指针不会自动为空
因此我们有责任为销毁的变量的所有指针都设置为nullptr


尽可能支持引用而不是指针；
*/

