//指针与常量
/*
int main()
{
    int x { 5 };
    int* ptr { &x }; // ptr 是一个普通（非常量）指针

    int y { 6 };
    ptr = &y; // 可以指向其他对象

    *ptr = 7; // 可以改变指向的对象的内容

    return 0;
}
对于非常量指针 可以更改他指向的对象
也可以更改所指向对象的值

如果指向的是常量
const int x { 5 }; // x 是 const
int* ptr { &x };   // 编译失败: 无法从 const int* 转换到 int*

常量的指针为类型前要有const 但是指针本身不是常量


指向常量值的指针;
const int x{ 5 };
const int* ptr { &x }; // okay: ptr 现在指向 "const int"
*ptr = 6; // 不被允许: 不能修改常量
常量的指针为类型前要有const 但是指针本身不是常量
还可以对指针进行重定向，
但是也可以指向非常量
会将其视为常量



指针常量（const 指针：
也可使指针自身成为常量
int x{ 5 };
int* const ptr { &x }; // 星号后面的 const 代表这是一个 const pointer
与普通常量一样 必须在定义时初始化，并且不可修改
但是指向的值是非常量，因此可以通过*ptr来修改所指向的数值




指向常量值的指针常量;
int value { 5 };
const int* const ptr { &value }; // const指针，指向const对象
这样指针所指向的对象被固定
并且对象也不可更改了






指针和常量重述:
总而言之，您只需要记住4条规则，它们非常符合逻辑：
1.可以为非常量指针分配另一个地址，以更改它所指向的对象。
2.指针常量始终指向相同的地址，并且不能更改该地址。
3.指向非常量的指针可以更改它所指向的值。它不能指向常量。
4.指向常量值的指针在通过指针访问时将该值视为常量，因此不能更改它所指向的值。
指针常量可以指向非常量或常量左值（但不能指向右值，因为右值没有地址）





星号之前的const与所指向的类型相关联。因此，这是一个指向常量值的指针，不能通过指针修改该值。
星号后面的const与指针本身相关联。因此，不能为该指针分配新地址。

*/