//检测和处理错误
/*



函数内部的错误处理策略:
1.处理函数中的错误
2.将错误传递回调用方以处理
3.停止程序
4.抛出异常







处理函数中的错误:
最好是在同一函数中恢复错误：有重试和停止两个选项。
1.重试直到成功
2.取消正在执行的操作


1.如果是函数外的原因导致的错误，可以重试直到成功。
2.另一种是忽略或取消操作：
void printDivision(int x, int y)
{
    if (y != 0)
        std::cout << static_cast<double>(x) / y;
}
如果y=0 则直接返回，不执行if
这是忽略

void printDivision(int x, int y)
{
    if (y != 0)
        std::cout << static_cast<double>(x) / y;
    else
        std::cout << "Error: Could not divide by zero\n";
}
后面加上这一句 
y=0 执行else语句
取消除法，打印错误语句











将错误传回调用方：
很多情况下，错误无法在函数中被合理处理
double doDivision(int x, int y)
{
    return static_cast<double>(x) / y;
}
如果y=0
这个函数只做计算，无法处理错误，因为用户输入可能在别的函数中，
所以要将错误传递给调用方，使调用方处理。
如何传递呢？
可以将计算函数的返回值设为bool值/别的值
这样调用方可以检查返回的值，用条件语句判断
以达成传递的目的









致命错误：
如果错误很严重，程序无法继续正常运行，称为不可恢复错误（致命错误）
最好终止程序。
main函数中，最好办法是直接return 0；
然而如果发生在嵌套子函数中，将错误传播回main是不现实的，这种情况下用std::exit()









Exceptions (异常)：
将错误返回给调用者比较复杂，
c++提供了一种完全独立的方法将错误传递给调用者：exceptions。

基本思想是，当错误发生，会“抛出“异常，如果当前函数没有“捕获“错误
则调用方就有机会捕获错误，如果调用方没捕获，则调用方的调用方则有机会捕获，
直到被捕获并处理。






何时使用std::cout、std::cerr与日志：
默认情况下，std::cout和std::cerr都会将文本打印到控制台。
然而，现代操作系统提供了将输出流重定向到文件的方法，
因此可以把输出捕获到文件中，以便以后审查或自动处理。也就是日志。


两种应用程序:
1.交互式应用程序，我们平时用的
2.非交互式应用程序，不需要用户交互即可运行的。


其中非交互的又分为：
1.工具类：通常是为了产生某些即时结果而启动，并在产生结果后终止。
2.服务类：通常在后台静默运行以执行某些功能。



这里有一些经验法则：
1.面向用户的文本输出结果使用std::cout。
2.对于交互式应用
 std::cout 用于普通用户
 std::cerr或日志 用于记录状态和诊断
3.对于非交互应用
 std::cerr用于错误输出


*/