//断言
/*
函数的参数传入时，只会检查语法上有没有错误，不会检查语义是否错误

void printDivision(int x, int y)
{
    if (y != 0)
        std::cout << static_cast<double>(x) / y;
    else
        std::cerr << "Error: Could not divide by zero\n";
}
显示的检查参数是否有语义错误（也就是y是不是0）；


上一课中提供了两种处理方法：
1.停止程序
2.跳过有问题的语句
然而这两种偶有问题
第二种：本质上静默失败，这会掩盖错误；
第一种：程序终止，我们会丢失堆栈，也就是所有信息。这时候std::abort是最好的选择。







前置条件、不变量和后置条件：

前置条件是在执行某些代码段（通常是函数体）之前必须为true的条件。
比如上方的的检查y;
前置条件最好放在顶部，以便于不满足是提前返回;


不变量是在执行代码的某些部分时必须为true的条件。这通常用于循环，其中循环体只在不变量为true时执行。


后置条件是在执行代码的某些部分后必须为true的条件。
也就是执行完了必须为true；





断言：
使用条件语句检测参数，然后打印错误信息并终止；
这种很常见方法，C++为此提供快捷方式；

断言是一个表达式。如果为true，则不执行任何操作，如果为false，则显示错误并终止程序；
使用断言：
#include <cassert>

函数()
{
    assert(表达式)；
    函数体；
}

鼓励使用断言来判断问题所在；








使断言语句更具描述性：
assert(found);
如果这个断言被触发：会输出
Assertion failed: found, file C:\\VCProjects\\Test.cpp, line 34

我们可以使得这个输出更有描述性：
assert(found && "Car could not be found in database");
包含字符串文本bool总是为true，所以不会影响断言判断；
但是断言触发时候会显示的把字符串也打出来；




断言与错误处理的区分：
断言是记录不该发生的事情，不允许从错误恢复。
错误处理是处理可能的错误，并让程序恢复错误，继续运行，不是什么不可恢复的。

使用断言来记录逻辑上不可能的情况。





NDEBUG：
每次检查断言条件时，断言宏都会产生较小的性能开销。
只有测试的时候才会使用断言，一般最后的成品代码都是测试好了的，
所以可以用一个开关关闭断言；
一般都会自动关掉，如果想要在发布版本中出发断言，得去特意设置；
但有些也不会；




一些断言限制和警告：
断言有一些缺陷和限制：
1.断言语句本身写的不对。比如判断语句写错了，或者字符串写错了；
2.其次断言应该没有副作用。程序有没有断言运行都应该相同；
断言本质是调用abort();即直接退出，不保证清理资源；
因此断言应该只在程序意外终止且不太可能造成损害的情况下使用；


static_assert：
C++还有另一种类型的断言，称为static_assert。
static_assert是在编译时而不是运行时检查的断言，失败的static_assert会导致编译错误。
static_assert(条件表达式, 诊断信息)
不需要头文件；
关于static_assert的一些有用点：
1.由于static_assert在编译期计算，因此条件表达式必须是常量表达式。
2.static_assert可以放在代码文件中的任何位置（甚至在全局命名空间中）。
3.static_assert不会在发布版本中被禁用。
*/