//函数重载简介
/*


int add(int x, int y)
{
    return x + y;
}
这是两个整形相加的函数
如果我们需要浮点数相加函数
1.第一个结局方法是，写一个新的；
并且还要为这些类似的函数取差不多的名字
以便于调用的时候比较清晰；
2.函数重载



函数重载简介：
允许我们创建多个同名的函数
只要它们分别具有不同的参数类型以用来区分；
我们就可以区分调用；


int add(int x, int y) // 整数版本
{
    return x + y;
}

double add(double x, double y) // 浮点数版本
{
    return x + y;
}

这俩都是add函数 不过类型不一样，这样编译器也不会报错；




重载决议：
当我们使用add函数时，编译器会根据函数调用中
传入的参数
来决定调用哪个函数；



1.每个重载的函数都要与他的兄弟不同
2.在调用它们大家族的时候，每一次调用编译器都可以清晰的知道并且找到用哪个
满足以上两个，才能编译；
*/