//函数重载决议
/*

当我们所有重载函数都区分好了还不够：
你还要保证调用的时候也能匹配上有的函数；
将函数调用与特定重载函数匹配的过程称为重载决议。


在调用值和函数参数类型完全匹配的简单情况下，这通常很简单：
void print(int x)
{
     std::cout << x << '\n';
}

void print(double d)
{
     std::cout << d << '\n';
}
print(5); // 5 是 int, 所以匹配 print(int)
print(6.7); // 6.7 是 double, 所以匹配 print(double)

但是如果这样？
print('a'); // char 不匹配 int 或 double
print(5L); // long 不匹配 int 或 double
这种并不意味着完全不匹配，因为可以隐式转换
所以要转换成哪种呢？


函数重载决议：
决议时将执行一些列规则：
在每个步骤中，编译器都会将一系列不同的类型转换应用于函数调用中参数；
然后检查转换后是否可以匹配上。
每次转换的结果是下面的三个一种：
1.找不到匹配的函数.进行下一次转换
2.找到了匹配的函数，直接执行
3.找到多个匹配的函数，报错；

如果下列匹配序列都走完还没找到，则会生成编译错误；




参数匹配序列：
步骤一）
查找精确匹配  将会分为两步：
1.编译器先查找有没有重载函数完全匹配；
2.对函数调用参数进行琐碎的转换，修改类型而不修改值进行匹配；
例如非常量更改为常量；

步骤二）
找不到精确匹配，进行数值提升来查找匹配：

步骤三）
如果还是不行，则进行数值转换来查找:

步骤四）
如果还是不行，
尝试通过用户定义的转换来查找，以后再讲








不明确的匹配：
对于非重载函数：
1.要么函数调用可以精确找到函数
2.要么在找不到时发出编译错误；

对于重载函数：
会有第三种：即上述步骤其中之一时发现多个匹配的
这时候会发生不明确匹配；编译器会报错
void print(int)
{
}

void print(double)
{
}

int main()
{
    print(5L); // 5L 是类型 long

    return 0;
}
步骤一 没有精确匹配
步骤二 数值提升也找不到
步骤三 数值转换 可以找到俩
因为long可以转换成int 和double
所以这就叫不明确匹配
编译器将报错




修正不明确的匹配：
由于不明确匹配会发出编译错误
因此必须改代码
1.通常是 去手动给他加一个可以完全精确匹配的函数
2.或者 显示的将那个调用里参数转换成可以匹配的



匹配具有多个参数的函数：
会将匹配规则依次应用于每个参数
这样一层层筛选，最后显然是最好的选择

*/