//函数模板
/*


int max(int x, int y)
{
    return (x < y) ? y : x;
}
只能传入int值
如果要比较其他类型
我们可以创建其它类型的重载版本

1.维护困难
2.违反了DRY(不要重复自己)原则

模板来了
C++模板简介：模板系统旨在简化创建能够处理不同数据类型的函数（或类）的过程。
就像普通定义：
我们定义模板 来描述函数或者类的外观。
与普通定义不同的是
我们可以定义模板时 使用占位符，
表示在编写模板时未知的东西,但稍后将提供

定义了模板，编译器可以根据需要生成任意多个重载函数。

最终结果与手动编写是相同的：
我们得到了一组类似的函数；
但是我们只需要维护一个模板，编译器将会为我们完成所有重复和繁琐的工作；




创建模板化的max函数：
int版本的max函数
int max(int x, int y)
{
    return (x < y) ? y : x;
}
我们在此函数中三次使用int类型
那么编写模板时，就要用模板类型去替代这仨
下面是使用单个模板类型的新函数
T max(T x, T y) 
{
    return (x < y) ? y : x;
}
但是编译器不知道T是什么
此时他依旧只是一个普通函数，而不是模板函数

因此我们要告诉编译器
1.这是一个模板函数
2.T是一个模板类型，也就是某种占位符

所以我们要：
template <typename T> // 这是模板参数声明
T max(T x, T y) // 这是函数模板 max<T> 的定义
{
    return (x < y) ? y : x;
}
这就创建好了一个模板；






*/