//作用域、存储期和链接摘要
/*

作用域摘要:
作用域确定可以在源代码中访问标识符的位置。
1.具有块作用域的变量从声明点开始访问，到该块结束
包括：
局部变量
函数参数
代码块中类型定义
2.具有全局作用域的变量和函数从声明点开始可以访问，直到文件结束
包括：
全局变量
函数
命名空间（全局或非全局）中类型定义





存储期摘要：
存储期决定了它的创建和销毁时间。
1.具有自动存储期的变量在定义点创建，并在退出它们所属的块时销毁。这包括：
局部变量
函数参数
2.具有静态存储期的变量在程序开始时创建，在程序结束时销毁。这包括：
全局变量
静态局部变量
3.具有动态存储期的变量由程序员请求创建和销毁。这包括：
动态创建的变量



链接摘要：
标识符的链接属性确定标识符的多个声明是否引用同一实体（对象、函数、引用等）。
也就是多次声明是不是一个
1.没有链接的标识符意味着该标识符仅引用其自身。
局部变量
代码块中类型定义
2.具有内部链接的标识符可以在其声明的文件中的任何位置访问。
Static 全局变量
Static 函数
Const 全局变量
在未命名的命名空间中声明的函数
在未命名的命名空间中类型定义
3，具有外部链接的标识符可以在其声明的文件或其他文件中的任何位置访问（通过前向声明）。
函数
非常量全局变量
Extern const 全局变量
Inline const 全局变量




*/