//为什么（非常量）全局变量是邪恶的
/*
大型项目中全局变量很致命





为什么（非常量）全局变量是邪恶的：
不知道在何时会被更改；
全局变量也会降低程序的模块化程度和灵活性。只使用其参数并且没有副作用的函数是完全模块化的。
最佳实践
尽可能使用局部变量而不是全局变量。



全局变量的初始化顺序问题：
执行main之前 静态变量初始化
1.静态初始化：有初始值的全局变量被初始化为对应值，没有的初始化为0；
2.动态初始化：初始化具有非constexpr初始值设定项的全局变量。 也就是编译期求不出值的
对于每个阶段，全局变量通常按定义顺序初始化：
不要让变量依赖于其他变量的初始化值。
也就是说 如果变量的值 编译完就知道了 比如是字面值 或者 没有值 或者用的constexpr函数初始化 总之编译时已经知道值了 那么main之前就会静态初始化
但是如果是用的不允许编译期求值(不带有constexpr的函数)来初始化 那么就会动态初始化，根据顺序来，这时要注意顺序



那么，使用非常量全局变量的充分理由是什么呢？
大部分情况下还是不要使用，但是有些时候用就比较好；
比如日志：将其定义为全局变量是有意义的，因为您可能在程序中只有一个日志，并且它可能会在程序中的任何地方使用。


保护自己免受全局变量破坏：
如果您确实很好地使用了非常量全局变量，那么一些有用的建议将最大限度地减少您可能遇到的麻烦。这个建议不仅适用于非常量全局变量，而且可以帮助处理所有全局变量。
1.如果一些变量本来就是g开头的，没法反应过来是全局变量，可以用命名空间修饰
2.与其直接访问全局变量 不如封装变量; 
比如 一个变量 与其 
extern const double a;
不是定义
const double a;
double gravity()
{
 return a;
}
//用一个函数返回其值 而不是直接调用全局变量
3.当一些独立函数使用全局变量时，不要直接用，而是通过参数传入调用；
#include <iostream>

namespace constants
{
    constexpr double gravity { 9.8 };
}

// 这个函数可以根据不同的gravity，来计算速度 (更加通用)
double instantVelocity(int time, double gravity)
{
    return gravity * time;
}

int main()
{
    std::cout << instantVelocity(5, constants::gravity) << '\n'; // 将常量作为参数进行传递

    return 0;
}
*/