//隐式类型转换


/*
类型转换简介
1.一个对象在内存中以二进制存储
2.对象的数据类型会告诉编译器如何将这个二进制解释为有意义的值，也就是显示出来


float f{ 3 };
当我们这么做时：
编译器将整数3转换为浮点数3.0再存储

这种叫做类型转换：
1.隐式触发（编译器需要时）
2.显示触发（程序员显示请求）


隐式类型转换：
当需要某种类型的数据，但实际提供的是其他类型的数据时，编译器会自动执行隐式类型转换。
1.使用其他数据类型的值初始化时：
double d{ 3 };
d = 6;
这里3和6都会被转换为浮点

2.当返回值的类型与函数声明的返回类型不同时：
float doSomething()
{
    return 3.0; // double 3.0 隐式转换为 float
}


3.将某些二元运算符与不同类型的操作数一起使用时：
double division{ 4.0 / 3 }; // int 3 隐式转换为 double 类型


4.在if语句中使用非布尔值时：
if (5)  这里超过1的都会被转换为1 也就是true


5.当传递给函数的值与函数参数的类型不同时：
void doSomething(long l)
{

}
doSomething(3); // int 3 隐式转换为 long 类型







类型转换时会发生什么：
1.编译器将确定它是否可以将值从当前类型转换为所需的类型。
2.如果可以找到有效的转换，则编译器将生成所需类型的新值。
而不会改变旧值的值或者类型；
3.如果编译器找不到可接受的转换，则编译将失败，并产生编译错误。


标准转换：（转换规则）
C++语言标准定义了如何将不同的基本类型转换为其他类型。
这些转换规则称为标准转换。
标准转换可大致分为4类，每个类别涵盖不同类型的转换：
1.数值提升
2.数值转换
3.算术转换
4.其他转换（包括各种指针和引用转换


转换时会查找规则，并且可以用多个。








*/