//数值提升
/*
c++每个类型都有最小大小保证。实际大小因编译器和体系结构而异；


类型大小的可变性可以使数据再特定架构上被设定为性能更好的大小。
数据类型使用的位数称为其宽度。更宽的数据类型使用更多比特，更窄的数据类型则使用更少比特。



数值提升：
CPU算自己自然长度的数据最顺手，因此不假设CPU能够高效处理比其自然数据窄的值；
为了解决，定义了一类类型转换，成为数值提升。
将某些较窄的数据类型转换为较宽的数据类型，比如提升到CPU自然长度类型；

所有的数值提升都是保值的，也就是不改变值的大小；
由于源类型的所有值都可以在目标类型中精确表示，因此成为“安全转换”；

由于是安全转换，所以编译器会根据需要自由使用，且不会警报；





数值提升减少冗余：
假如我们想打印一个int；我们会为他编写一个打印函数
但是我们还想打印short和char 如果没有数值提升，我们每种类型都要写一个。
因此我们可以编写int和double参数的函数，然后当我们传入较窄类型的参数的时候，会自动数值提升



数值提升类别：
数值提升规则分为两个子类别：
整型提升和浮点提升。
这俩类别中列出的转换才被视为数值提升；


浮点提升：
double宽，float窄
也就是可以编写一个参数是double的函数，给他传入double或者float;




整型提升：比较复杂
可以进行以下转换：
1.有符号char或者有符号short可以转换为int    //char本质是8bit int  short是16 bit int
2.一个类型的整个范围都可以被int保存，也就是小于32位，那无符号的对应类型可以直接存，否则转换为unsigned_int;
3.默认下类型char是有符号的，则遵循有符号char转换，默认下无符号则遵循无符号规则
4.bool可以转换为int，false为0，true为1；



如果int类型具有4个字节或者更大的字节数，
bool、char、signed char、unsigned char、signed short和unsigned short都被提升为int。

大多数情况下，允许我们编写带int参数的函数，然后传入其他类型；
#include <iostream>

void printInt(int x)
{
    std::cout << x << '\n';
}

int main()
{
    printInt(2);

    short s{ 3 };
    printInt(s); // 整型提升 short 转 int

    printInt('a'); // 整型提升 char 转 int
    printInt(true); // 整型提升 bool 转 int

    return 0;
}
//int真是万金油



并非所有扩大转换都是数值提升：
一些扩展的转换
如char 到 short
int  到 long
不被称为数值提升，这叫数字转换

*/