//数值转换
/*
数值提升的规则涵盖的都叫数值提升

其他的叫数值转换：
五种基本类型
1.
short s = 3; // int to short
long l = 3; // int to long
char ch = s; // short to char
unsigned int u = 3; // int to unsigned int

2.
float f = 3.0; // double to float
long double ld = 3.0; // double to long double

3.
int i = 3.5; // double to int

4.
double d = 3; // int to double

5.
bool b1 = 3; // int to bool
bool b2 = 3.0; // double to bool


大括号初始化严禁某些数值转换，因此本次先全使用拷贝初始化，（没有任何限制）








安全与潜在的不安全转换：
与数值提升不同，某些情况下数值转换不保持源值大小；
这就叫“不安全”；

数值转换中的三个类别：
1.目标类型可以精确保存当前类型的所有值，这是安全的数值转换。
列入int 到long 或者 short到double 安全的转换
    int n { 5 };
    long l = n; // okay, 产出 long 5

    short s { 5 };
    double d = s; // okay, 产出 double 5.0



编译器通常不会对这种隐式保值转换产生警告；
使用保值转换时，通常可以再转换为源类型，与原始值相同；



2.数值重解释转换是潜在不安全的转换，因为转换后的值可能不在原类型的范围内。
有符号与无符号之间的转换就属于这一类。

也就是一块内存里的值，不进行数值转换，而是直接拿新的规则去解释；
int n1 { 5 };
unsigned int u1 { n1 }; // okay: 转换成 unsigned int 5 (值会保留)

int n2 { -5 };
unsigned int u2 { n2 }; // bad: 会生成超过 signed int 范围的超大数字


5是正数，所以直接转换没有问题
但是-5是负数，直接转换 最高位的负数符号1 会将这个值变成超级大的正数
转换完已经超过原本的有符号的范围里，一般不保留。


这种转换可能不安全，但大多数编译器都不会警告；
因为有些时候这些转换时必需的，且不会更改值；
如果每次都警告，岂不是虚假警告，反而会淹没真正有用的；

使用重新解释转换转换的值可以转换回源类型，从而产生与原始值相等的值（即使初始转换产生的值超出源类型的范围）。
也就是再把规则换回去：
int u = static_cast<int>(static_cast<unsigned int>(-5));
std::cout << u << '\n'; // prints -5







3.有损转换是潜在不安全的转换，因为它可能会丢失数据。
double到int是可能导致数据丢失的转换：
int i = 3.0; // okay: 转换到 int 3 (值会保留)
int j = 3.5; // 数据丢失: 转换到 int 3 (分数部分 0.5 丢失)
从双精度到单精度的转换也可能导致数据丢失：
float f = 1.2;        // okay: 转换到 float 1.2 (值会保留)
float g = 1.23456789; // 数据丢失: 转换到 float 1.23457 (精度丢失)

如果再见丢失数据的值转换回去，还是会与原始值不同：
double d { static_cast<double>(static_cast<int>(3.5)) }; // 将 double 3.5 转 int 再转回
std::cout << d << '\n'; // 打印 3
也就是将3.5转换到int,丢弃小数部分，变为3
再转回double，变为3.0；
当执行隐式有损转换时，编译器通常会发出警告。





关于数值转换的更多信息：
数值转换规则太多，因此需要记住最重要的：
在所有情况下，将值转换为范围不支持该值的类型将导致可能意外的结果。
int i{ 30000 };
char c = i;      
char的范围是-128 到 127 ,字符会溢出，产生意外结果；

1.如果值比较小，则从较宽的整数或浮点转换为同族较窄的类型通常是有效的；
int i{ 2 };
short s = i;
虽然i比s更宽 但是值的范围较小，依旧可以同族转化；
2.如果是浮点值，如果值的位数超过精度，会发生舍入，精度会发生损失；
float f = 0.123456789;   
0.123456789有9个有效数字，float只能支持7位，所以只能存0.1234567
如果std::setprecision(9) 后面两位将会随机
3.只要值适合浮点类型的范围，从整数值转换为浮点数通常可以通过，无非就是加了.00000
4.只要值适合整数范围，可以从浮点转换为整数，不过小数丢失；




*/