//窄化转换、列表初始化和constexpr初始化
/*
窄化转换：
窄化转换（narrowing conversion）是一种潜在的不安全的数值转换，其中目标类型可能无法保存源类型的所有值。


以下转换被定义为窄化转换：
1.从浮点类型到整型。
2.浮点类型转换到同族较窄的类型，除非要转换的值是constexpr并且在目标类型的范围内；
如果不是constexpr，在用{}初始化时，会报错，拷贝初始化不检查是否是窄化，
3.从整数转换到浮点，除非要转换的是constexpr，并且其值也在目标类型范围里。
4.从整形转换到 任一不能表示原始数据的另一类型，
除非要转换的是constexpr 并且可以精确存储在目标类型里；

多数情况下，隐式窄化转换会警报，但有符号/无符号转换除外；
应尽可能避免窄化转换，因为它们可能不安全，是潜在错误的来源。







有意地显式进行窄化转换：
有时候必须要用窄化转换， 尤其是对于函数，函数参数可能和传入的类型不匹配，需要窄化转化
这种情况下使用static_cast将隐式替换为显示窄化；这样编译器也不会警告或错误；
void someFcn(int i)
{}

int main()
{
double d{ 5.0 };
someFcn(static_cast<int>(d)); // 不会产生警告
}










大括号初始化不允许窄化转换：
使用大括号初始化不允许隐式窄化，这样可以避免错误；
int i { 3.5 }; // 编译失败
如果确实需要 使用static_cast<int>();




一些constexpr转换不被认为是窄化:
对于编译器可确定的转换不认为是窄化；
如果是运行时才能确定的，窄化转换会被报错
但是如果是constexpr，编译期编译器可以知道值是多少，且也知道目标类型是否能装下，
便不认为是窄化。
constexpr int n1{ 5 };   // note: constexpr
unsigned int u1 { n1 };  // okay: 这里的转换不被认为窄化

constexpr int n2 { -5 }; // note: constexpr
unsigned int u2 { n2 };  // 编译失败: 原值n2无法在u2里完全保存下来





使用constexpr进行列表初始化：
列表初始化非int非double对象时
使用int和double量进行初始化 
这样我们写代码很舒服，而且也达成了参数所要的类型
传参的时候直接用int和double传参
因为源值不超过非int和非double的类型的宽度，所以可以直接传入

只要值在目标类型的范围内，就允许使用constexpr值来初始化较窄的浮点类型，即使目标类型没有足够的精度来精确存储该值！

*/