//算术转换
/*

如果操作符的操作数类型不同时:
y{2+3.5}
此时y的类型由算数转换规则决定；


需要相同类型操作数的运算符：
1.二元算术运算符：+, -, *, /, %
2.二元关系运算符：<, >, <=, >=, ==, !=
3.二进制逐位算术运算符：&, ^, |
4.条件运算符 ? :
当你输入不同的类型时会发生转换；


常用的算术转换规则:
编译器的类型排名列表：
1.long double
2.double
3.float
4.long long
5.long
6.int


从下往上 会转换成出现的最高的类型






一些例子：
int i{ 2 };
double d{ 3.5 };
std::cout << typeid(i + d).name() << ' ' << i + d << '\n';
会同步成double


如果是两个short类型，
由于short类型都不在优先级列表中，因此全部都整形提升
全部提升为int 相加为int




有符号/无符号的问题：
混合有符号和无符号问题时，
结果会超出我们的期望，不要混用
*/