//显式类型转换和static_cast
/*


数值从较窄的隐式提升为较宽的是可以的；
double d = 10 /4 ； 10和4 都是int  所以求出来也是int 也就是2 再隐式转换为double 2.0；

如果是double d = 10.0/4.0 ； 那么就是2.5
如果是使用变量来进行计算
int x{10};
int y{4};
double d = x/y;                
依旧是整数除法；


这种情况下 怎么把x和y变为浮点值再计算？
C++提供了许多不同类型的转换操作符，使用这些操作符来请求编译器进行类型转换；
因此叫做显示类型转换(与隐式转换相反，后者是自动执行，这个是显示请求）






类型转换：
C++支持5种不同类型的强制转换：C样式转换、静态转换、常量转换、动态转换和重解释转换。后四种有时被称为命名转换。
这里学习C样式转换和静态转换；
通常避免常量转换和重解释转换，因为他们只有极少数情况下有用，使用不当，可能会造成危害；






C样式转换:
标准C编程中，通过()进行类型转换，类型放在括号中，要转换的值放在括号后；
如：
int x { 10 };
int y { 4 };
double d{(double)x/y};
此时 将x转换为double，此时由于有浮点数当操作数，此时执行浮点除法
还可以使用类似于函数调用的语法进行转换
double(x) 和上面一个效果；
这种方式可以根据上下文执行不同类型的转换：
可以是静态转换，常量转换，和重解释转换；






静态转换：
C++引入了static_cast的转换操作符，可用于一种类型的值转换为另一种；
char c { 'a' };
std::cout << c << ' ' << static_cast<int>(c) << '\n';


int x { 10 };
int y { 4 };

// static cast 将 x 转换为 double，以便执行浮点数除法
double d { static_cast<double>(x) / y };
也是将x转换为浮点数 以执行浮点除法



static_cast主要优势是提供了编译时类型检查，
int x { static_cast<int>("Hello") }; // 无效: 编译失败
// 一个 C样式字符串字面值不能被转换为int，所以下面是一个非法的转换


但是经过static_cast转换的值不能删除const
如果被转换的值是const 则目标类型也要带const类型；







使用static_cast使窄化转换显式；
当执行隐式窄化转换时，编译器会警告；
我们可以用这个static_cast进行显示窄化转换；


int i { 48 };
char ch = i; // 隐式窄化转换，会报错
char ch { static_cast<char>(i) };  //显示窄化转换,不报错

int i { 100 };
i = i / 2.5;
隐式将double转换为int 数据会丢失 编译器报错
int i { 100 };
i = static_cast<int>(i / 2.5);
显示窄化转换









*/