//for语句
/*

for (初始化语句; 条件表达式; 递增/递减表达式)
   语句;
相当于while：
int i = 初始化语句;
while (条件表达式)
{
   语句;
   i = 递增/递减表达式;
}




for语句的计算：
for语句分为3阶段执行：
1.执行初始化语句,并且这些变量具有循环作用域，也就是在这个循环中可以使用这些变量
2.判断条件表达式的值，如果为true，则执行语句块，否则跳出循环
3.执行递增/递减表达式，然后回到第2步



在for循环条件中使用 != 操作符有些危险：
for (int i { 0 }; i < 10; ++i) // 使用 <
     std::cout << i;

for (int i { 0 }; i != 10; ++i) // 使用 !=
     std::cout << i;
第二种如果中途将10跳过 便会无限循环
第一种即使跳过10也会在下一次循环中退出循环






少迭代一次的错误：
最常见的问题之一是条件表达式写错，导致循环多迭代或少迭代一次。
也就是计数器的判断表达式错了；

for (int i{ 1 }; i < 5; ++i)
    {
        std::cout << i << ' ';
    }
只会循环4次，输出1 2 3 4，i加到5时，条件表达式不成立，循环结束。




省略的表达式：
for语句中的任何部分都可省略。
int i{ 0 };
for ( ; i < 10; ) // 省略初始化语句和递增/递减表达式
    {
        std::cout << i << ' ';
        ++i;
    }
前面已经声明了变量，然后函数体写了递增/递减表达式
，所以可以省略for语句中的初始化语句和递增/递减表达式

for (;;)
    语句;
如果省略条件表达式，则条件表达式的值为true，循环将无限执行下去，
直到遇到break语句或return语句才会退出循环.







具有多个计数器的循环：
也就是多个
 for (int x{ 0 }, y{ 9 }; x < 10; ++x, --y)
    std::cout << x << ' ' << y << '\n';







循环嵌套：
for循环可以嵌套在其他循环中。
for (char c{ 'a' }; c <= 'e'; ++c) // 遍历a到e的字母
	{
		std::cout << c; // 打印字母
		
		for (int i{ 0 }; i < 3; ++i) // 内层循环遍历0到2
			std::cout << i;

		std::cout << '\n';
	}
每次外部循环迭代
内部循环都会重新开始一次
因为内部循环也是外部循环的一部分，所以每次外部循环迭代时，内部循环都会重新开始一次。














*/
