//提前退出程序
/*
讨论退出程序控制流语句，
但是它是通过函数实现的（而不是关键字），因此退出时需要调用函数

程序正常退出时：
当main()函数返回时（到达函数末尾或通过return语句返回），
1.程序离开main函数，所有局部变量和函数参数全部销毁
2.调用一个名为std::exit()的特殊函数，并将main()的返回值作为参数传入





std::exit()函数：
exit()是一个导致程序正常终止的函数。正常终止意味着程序以预期的方式退出。




显式调用std::exit()：
1.std::exit(0)；返回0 后面的语句不会执行
2.并且任何函数都可以调用，来终止程序
3.显式调用不会清理局部变量



std::atexit:
显示调用std::exit()不会清理局部变量，
所以出现了这个函数
std::atexit()函数：允许指定一个函数，以在程序终止时自动调用
但是是在调用std::exit()时才会调用，atexit只是注册
在退出时清理一下东西;
示例：
void cleanup()
{
    // 这里来做一些清理工作
    std::cout << "cleanup!\n";
}

int main()
{
    // 注册 cleanup()，这样当调用到std::exit()时，cleanup函数会被自动调用
    std::atexit(cleanup); // 注: 这里是cleanup，而不是cleanup()，因为这里需要的是一个函数，而不是函数调用
    std::cout << 1 << '\n';

    std::exit(0); // 结束程序执行，并将0返回给操作系统

    // 下面的代码不会执行到
    std::cout << 2 << '\n';

    return 0;
}
注意：
1.由于main()终止时会隐式调用std::exit()，因此如果程序以这种方式退出，也会调用std::atexit()注册的所有函数。
2.其次，被注册的函数必须没有参数，并且没有返回值。
3.如果需要，可以使用std::atexit()注册多个清理函数，它们将按注册顺序的相反顺序调用





std::abort和std::terminate：
std::abort()导致程序异常终止。异常终止意味着程序出现某种异常运行时错误，程序无法继续运行。
以后再介绍


什么时候需要手动退出程序？
几乎不，因为正常退出才会销毁对象，而上面提到的终止都不可以

*/