//随机数生成
/*



算法（algorithm）和状态：
在C++中，算法通常被实现为可重用的函数。
int plusOne()
{
    static int s_state { 3 }; // 只在函数被调用时初始化一次

    // 产出下一个数字

    ++s_state;      // 首先修改s_state
    return s_state; // 返回修改后结果
}
比如这就是一个生成数字的算法，其中计数器s_state是static值，
所以每次调用时该值会被保留，则称这个算法是有状态的，无状态算法不保留任何信息；
每次调用：
1.修改当前状态，也就是更改当前变量
2.返回新状态，也就是返回新变量
该算法是确定性的




伪随机数生成器（PRNGs）：
unsigned int LCG16() // 我们自己的 PRNG
{
    static unsigned int s_state{ 5323 };

    // 产生下一个数字

    // 使用大的常量，和有意的数字溢出
    // 让别人不太容易猜到，下一个产出的数字

    s_state = 8253729 * s_state + 2396403; // 修改s_state
    return s_state % 32768;    // 使用s_state，算出伪随机数序列的下一位
}
该算法 其实并不算随机 因为是奇偶交替 ，但是其他算法差不多也是这样 用新状态去计算下一个 不过更复杂 变量更多罢了








指定PRNG的种子：
上面的第一个s_state我们称之为种子
要想让Prng产生高质量的随机数，状态一般至少16字节
如果你提供的种子不够长，就叫种子不足


理想状态下，状态中每一位都由相同字节的种子初始化的，
如果种子不足，初始化会复用种子中的一些比特，
并且会影响随机数质量；




什么是好的PRNG？
1.PRNG应以近似相同的概率生成每个数字
所有情况都应相等
2.生成序列中下一个数字的方法不应是可预测的
3.PRNG应具有良好的数字维数分布。
整个范围要都能够返回，所有结果都有机会
4.对于所有的种子，产出结果的周期都应该很长
因为所有prng都有周期性，这个周期应该足够长
5.PRNG应高效
状态小于4096字节
且每次更新状态都要快速，也就是计算要快（少量使用不碍事，大量使用就会影响性能）






有许多不同类型的PRNG算法：
每个PRNG算法都有优缺点，这会影响它是否适合特定应用程序，因此选择正确的算法非常重要。




C++中的随机数：
C++中的随机化功能可以通过标准库的头文件使用。在随机库中，有6个PRNG系列可供使用（从C++20开始）：
Mersenne Twister算法是C++附带的唯一一个性能和质量都不错的PRNG。
所以我们应该用Mersenne Twister，对吧？
可能吧，性能和质量都不错；
但是最大问题是624个数字后，结果可预测

第三方的prng：
1.Xoshiro 或 Wyrand，用于非加密的PRNG。
2.Chacha，用于加密（不可预测）的PRNG。






*/