//循环和while语句简介
/*



循环允许一段代码重复执行，直到满足某个退出条件。



While语句：
while (条件表达式)
    语句;
条件为true时，会执行语句；
执行完成，则会回到while顶部，并且重复，只要条件表达式为true就一直执行
int count{ 1 };
while (count <= 10)
{
    std::cout << count << ' ';
     ++count;
}
std::cout << "done!\n";
所以在count到11之前 函数块会重复



初始条件计算为false的语句：
如果上述程序count加到11
则会输出done！会跳过函数块




死循环（无限循环）：
如果表达式始终为true，则while会循环永远执行。便是死循环


有意的死循环：
退出方式是通过：
return
break 
exit
goto
引发异常
用户中止
 while (true) // 死循环
    {
        std::cout << "Loop again (y/n)? ";
        char c{};
        std::cin >> c;

        if (c == 'n')
            return 0;
    }
每次输入后都判断输入后是不是n字符
是n就返回




循环变量的命名：
循环变量就是控制循环啥时候停止的那个变量；
循环变量一般会命名一个简单的名称；



整型循环变量应该有符号:
整型循环变量几乎总是有符号的，因为无符号整数可能会导致意外问题。
会受表达式影响 比如 设置count <= 0 ，那岂不是永远为true




每N次迭代执行一次操作：
也就是间隔几次执行一次
if (count % 10 == 0) 这一个就是判断循环变量是不是10的倍数




嵌套循环：
内部循环和外部循环都有自己的计数器

*/